//sadly we cannot simply import files from ascent so we copy paste stuff we need here

#ifndef uint32
	typedef unsigned int uint32;
#endif
#ifndef int
	typedef int int32;
#endif

#ifndef ASSERT
	#define ASSERT assert
#endif

#define SERVER_DECL __declspec(dllexport)

const char * spellentrYFormat = "uuuuuuuuuuuuuuuuuuuuuuuuuuuuuiuuuuuuuuuufuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuffffffiiiiiiuuuuuuuuuuuuuuufffuuuuuuuuuuuufffuuuuuxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxuuuuuuuuuuifffuuuuuu";
/*
uuuuuuuuuu
uuuuuuuuuu
uuuuuuuuui
uuuuuuuuuu
fuuuuuuuuu
uuuuuuuuuu
uuuuuuuuuu
uuuffffffi
iiiiiuuuuu
uuuuuuuuuu
fffuuuuuuu
uuuuufffuu
uuuxxxxxxx
xxxxxxxxxx - 140
xxxxxxxxxx
xxxxxxxxxx
xxxxxxxxxx
xxxxxxxxxx
xxxxxxxxxx
xuuuuuuuuu
uifffuuuuu
u */

#define SPELL_DAMAGE_TYPE_MAGIC 1
#define SPELL_CATING_TIME_INSTANT 1

#define RANGEINDEX_10_YARDS 7
#define RANGEINDEX_20_YARDS 3
#define RANGEINDEX_30_YARDS 4
#define RANGEINDEX_40_YARDS 5
#define RANGEINDEX_SELF	1

#define DURATIONINDEX_1SEC	36
#define DURATIONINDEX_2SEC	39
#define DURATIONINDEX_3SEC	27
#define DURATIONINDEX_4SEC	35
#define DURATIONINDEX_5SEC	28
#define DURATIONINDEX_6SEC	32
#define DURATIONINDEX_8SEC	31
#define DURATIONINDEX_10SEC	1
#define DURATIONINDEX_15SEC	8
#define DURATIONINDEX_20SEC	18
#define DURATIONINDEX_25SEC	63
#define DURATIONINDEX_30SEC	9
#define DURATIONINDEX_35SEC	125
#define DURATIONINDEX_40SEC	64
#define DURATIONINDEX_45SEC	22
#define DURATIONINDEX_50SEC	245
#define DURATIONINDEX_60SEC	3
#define DURATIONINDEX_2MIN	4
#define DURATIONINDEX_5MIN	5
#define DURATIONINDEX_30MIN	30
#define DURATIONINDEX_INFINIT	21
#define DURATIONINDEX_NONE 0

#define RADIUSINDEX_10YARDS 13
#define RADIUSINDEX_20YARDS 9
#define RADIUSINDEX_30YARDS 10
#define RADIUSINDEX_40YARDS 23

enum SPELL_CLIENT_TARGETING_TYPE
{
	SPELL_CLIENT_TARGETTING_LOCATION = 64,
};

enum SPELL_ATTRIBUTESEX_FLAGS
{
	SPELL_ATTRIBUTESEX_FLAG_CHANNELED = 4,
};

#define SPELL_DBC_CLIENT_NUMBER "2.3.3"
//this might change from 1 version to another of the DBC
#define SPELL_COLUMN_COUNT 211

#define SQL_INSERTS_PER_QUERY 200

//soundEntry.dbc
struct SoundEntrys
{
	uint32	id;
	uint32	unk1;	//maybe priority or some grouping ? 1 = wav and 28 = mp3 ?
	uint32	internal_name;
	uint32	soundfilename1;
	uint32	soundfilename2;
	uint32	soundfilename3;
	uint32	soundfilename4;
	uint32	soundfilename5;
	uint32	soundfilename6;
	uint32	soundfilename7;
	uint32	soundfilename8;
	uint32	soundfilename9;
	uint32	soundfilename10;
	uint32	sound1repeat;
	uint32	sound2repeat;
	uint32	sound3repeat;
	uint32	sound4repeat;
	uint32	sound5repeat;
	uint32	sound6repeat;
	uint32	sound7repeat;
	uint32	sound8repeat;
	uint32	sound9repeat;
	uint32	sound10repeat;
	uint32	path; // without filename
	float	playspeed; //not sure
	uint32	flags;//not sure
	float	unk2; //seems to be 7 most of the time
	float	unk3; //seems to be 30 most of the time 
	uint32	unk4; //seems to be 2 for non tbc ?
};

//iconNames.dbc
struct IconNames 
{
    uint32 Id;
    uint32 iconpath;		//this is string
};

//SkillLineAbility.dbc
struct skilllinespell 
{
    uint32 Id;
    uint32 skilline;
    uint32 spell;
    uint32 unk1;
    uint32 unk2;
    uint32 unk3;
    uint32 unk4;
    uint32 unk5;
    uint32 next;
    uint32 minrank;
    uint32 grey;
    uint32 green;
    uint32 unk10;
    uint32 unk11;
    uint32 reqTP;
};

// Struct for 1 entry in Spell.dbc
// this must be a direct mapping of the original dbc entry. (no more or less values)
struct SpellEntry
{
	uint32 Id;                              //1
	uint32 Category;                        //2
	uint32 field4;                          //3 something like spelltype 0: general spells 1: Pet spells 2: Disguise / transormation spells 3: enchantment spells
	uint32 DispelType;                      //4
	uint32 MechanicsType;                   //5
	uint32 Attributes;                      //6
	uint32 AttributesEx;                    //7
	uint32 Flags3;                          //8
	uint32 Flags4;                          //9 // Flags to
	uint32 Flags5;                          //10 // Flags....
	uint32 unk201_1;                        //11 // Flags 2.0.1 unknown one
	uint32 unk240_1;						//12
	uint32 RequiredShapeShift;              //13 // Flags BitMask for shapeshift spells
	uint32 UNK14;                           //14-> this is wrong // Flags BitMask for which shapeshift forms this spell can NOT be used in.
	uint32 Targets;                         //15 - N / M
	uint32 TargetCreatureType;              //16
	uint32 RequiresSpellFocus;              //17
	uint32 unk240_2;						//18
	uint32 CasterAuraState;                 //19
	uint32 TargetAuraState;                 //20
	uint32 unk201_2;                        //21 2.0.1 unknown two
	uint32 unk201_3;                        //22 2.0.1 unknown three
	uint32 CastingTimeIndex;                //23
	uint32 RecoveryTime;                    //24
	uint32 CategoryRecoveryTime;            //25 recoverytime
	uint32 InterruptFlags;                  //26
	uint32 AuraInterruptFlags;              //27
	uint32 ChannelInterruptFlags;           //28
	uint32 procFlags;                       //29
	uint32 procChance;                      //30
	int32 procCharges;                      //31
	uint32 maxLevel;                        //32
	uint32 baseLevel;                       //33
	uint32 spellLevel;                      //34
	uint32 DurationIndex;                   //35
	uint32 powerType;                       //36
	uint32 manaCost;                        //37
	uint32 manaCostPerlevel;                //38
	uint32 manaPerSecond;                   //39
	uint32 manaPerSecondPerLevel;           //40
	uint32 rangeIndex;                      //41
	float  speed;                           //42
	uint32 modalNextSpell;                  //43
	uint32 maxstack;                        //44
	uint32 Totem[2];                        //45 - 46
	uint32 Reagent[8];                      //47 - 54
	uint32 ReagentCount[8];                 //55 - 62
	int32 EquippedItemClass;               //63
	uint32 EquippedItemSubClass;            //64
	uint32 RequiredItemFlags;               //65
	uint32 Effect[3];                       //66 - 68
	uint32 EffectDieSides[3];               //69 - 71
	uint32 EffectBaseDice[3];               //72 - 74
	float  EffectDicePerLevel[3];           //75 - 77
	float  EffectRealPointsPerLevel[3];     //78 - 80
	int32  EffectBasePoints[3];             //81 - 83
	int32  EffectMechanic[3];               //84 - 86       Related to SpellMechanic.dbc
	uint32 EffectImplicitTargetA[3];        //87 - 89
	uint32 EffectImplicitTargetB[3];        //90 - 92
	uint32 EffectRadiusIndex[3];            //93 - 95
	uint32 EffectApplyAuraName[3];          //96 - 98
	uint32 EffectAmplitude[3];              //99 - 101
	float  Effectunknown[3];                //102 - 104     This value is the $ value from description
	uint32 EffectChainTarget[3];            //105 - 107
	uint32 EffectSpellGroupRelation[3];     //108 - 110     Not sure maybe we should rename it. its the relation to field: SpellGroupType
	uint32 EffectMiscValue[3];              //111 - 113
	uint32 EffectTriggerSpell[3];           //114 - 116
	float  EffectPointsPerComboPoint[3];    //117 - 117
	uint32 SpellVisual;                     //120
	uint32 field114;                        //121
	uint32 icon;                           //122
	uint32 CoSpell;                         //123   activeIconID;
	uint32 spellPriority;                   //124
	uint32 Name;                             //125
	uint32 NameAlt1;                        //126
	uint32 NameAlt2;                        //127
	uint32 NameAlt3;                        //128
	uint32 NameAlt4;                        //129
	uint32 NameAlt5;                        //130
	uint32 NameAlt6;                        //131
	uint32 NameAlt7;                        //132
	uint32 NameAlt8;                        //133
	uint32 NameAlt9;                        //134
	uint32 NameAlt10;                       //135
	uint32 NameAlt11;                       //136
	uint32 NameAlt12;                       //137
	uint32 NameAlt13;                       //138
	uint32 NameAlt14;                       //139
	uint32 NameAlt15;                       //140
	uint32 NameFlags;                       //141
	uint32 Rank;                            //142
	uint32 RankAlt1;                        //143
	uint32 RankAlt2;                        //144
	uint32 RankAlt3;                        //145
	uint32 RankAlt4;                        //146
	uint32 RankAlt5;                        //147
	uint32 RankAlt6;                        //148
	uint32 RankAlt7;                        //149
	uint32 RankAlt8;                        //150
	uint32 RankAlt9;                        //151
	uint32 RankAlt10;                       //152
	uint32 RankAlt11;                       //153
	uint32 RankAlt12;                       //154
	uint32 RankAlt13;                       //155
	uint32 RankAlt14;                       //156
	uint32 RankAlt15;                       //157
	uint32 RankFlags;                       //158
	uint32 Description;                     //159
	uint32 DescriptionAlt1;                 //160
	uint32 DescriptionAlt2;                 //161
	uint32 DescriptionAlt3;                 //162
	uint32 DescriptionAlt4;                 //163
	uint32 DescriptionAlt5;                 //164
	uint32 DescriptionAlt6;                 //165
	uint32 DescriptionAlt7;                 //166
	uint32 DescriptionAlt8;                 //167
	uint32 DescriptionAlt9;                 //168
	uint32 DescriptionAlt10;                //169
	uint32 DescriptionAlt11;                //170
	uint32 DescriptionAlt12;                //171
	uint32 DescriptionAlt13;                //172
	uint32 DescriptionAlt14;                //173
	uint32 DescriptionAlt15;                //174
	uint32 DescriptionFlags;                //175
	uint32 BuffDescription;                 //176
	uint32 BuffDescriptionAlt1;             //177
	uint32 BuffDescriptionAlt2;             //178
	uint32 BuffDescriptionAlt3;             //179
	uint32 BuffDescriptionAlt4;             //180
	uint32 BuffDescriptionAlt5;             //181
	uint32 BuffDescriptionAlt6;             //182
	uint32 BuffDescriptionAlt7;             //183
	uint32 BuffDescriptionAlt8;             //184
	uint32 BuffDescriptionAlt9;             //185
	uint32 BuffDescriptionAlt10;            //186
	uint32 BuffDescriptionAlt11;            //187
	uint32 BuffDescriptionAlt12;            //188
	uint32 BuffDescriptionAlt13;            //189
	uint32 BuffDescriptionAlt14;            //190
	uint32 BuffDescriptionAlt15;            //191
	uint32 buffdescflags;                   //192
	uint32 ManaCostPercentage;              //193
	uint32 unkflags;                        //194 
	uint32 StartRecoveryTime;               //195
	uint32 StartRecoveryCategory;           //196
	uint32 SpellFamilyName;                 //197
	uint32 SpellGroupType;					//198+199
	uint32 SpellGroupType_high;				//198+199
	uint32 MaxTargets;                      //200 
	uint32 Spell_Dmg_Type;                  //201   dmg_class Integer      0=None, 1=Magic, 2=Melee, 3=Ranged
	uint32 FG;                              //202   0,1,2 related to Spell_Dmg_Type I think
	int32 FH;                               //203   related to paladin aura's 
	float dmg_multiplier[3];                //204 - 206   if the name is correct I dono
	uint32 FL;                              //207   only one spellid:6994 has this value = 369 UNUSED
	uint32 FM;                              //208   only one spellid:6994 has this value = 4 UNUSED
	uint32 FN;                              //209  3 spells 1 or 2   
	uint32 TotemCategory[2];				//210-211
	uint32 RequiresAreaId;				    //212 
	uint32 School;							// 213
};

// lets make this bitwise for more fun
enum SpellTypes
{
    SPELL_TYPE_NONE                 = 0x00000000,
    SPELL_TYPE_SEAL                 = 0x00000001,
    SPELL_TYPE_ASPECT               = 0x00000002,
    SPELL_TYPE_BLESSING             = 0x00000004,
    SPELL_TYPE_CURSE                = 0x00000008,
    SPELL_TYPE_STING                = 0x00000010,
    SPELL_TYPE_ARMOR                = 0x00000020,
    SPELL_TYPE_AURA                 = 0x00000040,
    //hmm these could be named simply incompatible spells. One active at a time
    SPELL_TYPE_MARK_GIFT            = 0x00000080,
    SPELL_TYPE_TRACK                = 0x00000100,
    SPELL_TYPE_HUNTER_TRAP          = 0x00000200,
    SPELL_TYPE_MAGE_INTEL           = 0x00000400,
    SPELL_TYPE_MAGE_MAGI            = 0x00000800,
    SPELL_TYPE_MAGE_WARDS           = 0x00001000,
    SPELL_TYPE_PRIEST_SH_PPROT      = 0x00002000,
    SPELL_TYPE_SHIELD               = 0x00004000,
